In [3]:
pip install pandas

Requirement already satisfied: pandas in c:\users\ruchi\anaconda3\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ruchi\anaconda3\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ruchi\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ruchi\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ruchi\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\ruchi\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
import numpy as np

Series in pandas

In [5]:
s = pd.Series([20,20,30,40])

In [6]:
print(s)

0    20
1    20
2    30
3    40
dtype: int64

Custom index

In [7]:
s=pd.Series([10,20,30],index=["a","b","c"])

In [8]:
print(s)

a    10
b    20
c    30
dtype: int64

In [9]:
print(s["a"])

10

In [10]:
print(s[0])

10

C:\Users\Ruchi\AppData\Local\Temp\ipykernel_20968\287792665.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[0])

Series from Dictionary

In [11]:
data = {"Math": 90, "Physics":85, "Chemistry":88}

In [12]:
marks=pd.Series(data)

In [13]:
print(data)

{'Math': 90, 'Physics': 85, 'Chemistry': 88}

In [14]:
print(marks)

Math         90
Physics      85
Chemistry    88
dtype: int64

DataFrame in pandas

In [15]:
data={
    "Name":["Aman","krish","karan"],
    "Age":[22,23,21],
    "Marks":[85,90,88]
}

In [16]:
print(data)

{'Name': ['Aman', 'krish', 'karan'], 'Age': [22, 23, 21], 'Marks': [85, 90, 88]}

In [17]:
type(data)

dict

In [18]:
marks=pd.DataFrame(data)

In [ ]:
print(marks) #Pandas automatically adds a default index: this is called a RangeIndex

    Name  Age  Marks
0   Aman   22     85
1  krish   23     90
2  karan   21     88

In [20]:
# we can also add custom indewx in pandas dataframe
marks=pd.DataFrame(
    data,
    index=["Student1","Student2","Student3"]
)

In [21]:
print(marks)

           Name  Age  Marks
Student1   Aman   22     85
Student2  krish   23     90
Student3  karan   21     88

In [22]:
marks.set_index("Name",inplace=True) #if we are setting inplace=True it means we are changing the original object itself.

In [23]:
print(marks)

       Age  Marks
Name
Aman    22     85
krish   23     90
karan   21     88

In [4]:
df=pd.DataFrame({
    "Name":["Aman","saurav","Karan"],
    "age":[22,23,21],
    "marks":[85,90,88]
})

In [25]:
print(df)

     Name  age  marks
0    Aman   22     85
1  saurav   23     90
2   Karan   21     88

In [ ]:
df.head() #as the no. of rows is less than 5 so the output of both df head and df tail will be identical

     Name  age  marks
0    Aman   22     85
1  saurav   23     90
2   Karan   21     88

In [ ]:
df.tail() #as the no. of rows is less than 5 so the output of both df head and df tail will be identical

     Name  age  marks
0    Aman   22     85
1  saurav   23     90
2   Karan   21     88

In [29]:
df = pd.DataFrame({
    "Name":["Aman","saurav","Karan","shubham","abhishek","sameer"],
    "age":[22,23,21,22,25,26],
    "marks":[85,90,88,90,56,70]
})

In [30]:
df.head(2)

     Name  age  marks
0    Aman   22     85
1  saurav   23     90

In [31]:
df.tail(2)

       Name  age  marks
4  abhishek   25     56
5    sameer   26     70

In [32]:
df.shape

(6, 3)

In [33]:
df.columns

Index(['Name', 'age', 'marks'], dtype='object')

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   age     6 non-null      int64
 2   marks   6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 276.0+ bytes

In [35]:
df.describe()

             age      marks
count   6.000000   6.000000
mean   23.166667  79.833333
std     1.940790  13.891244
min    21.000000  56.000000
25%    22.000000  73.750000
50%    22.500000  86.500000
75%    24.500000  89.500000
max    26.000000  90.000000

Selecting the data

In [36]:
df["Name"]

0        Aman
1      saurav
2       Karan
3     shubham
4    abhishek
5      sameer
Name: Name, dtype: object

In [38]:
df[["Name","marks"]]

       Name  marks
0      Aman     85
1    saurav     90
2     Karan     88
3   shubham     90
4  abhishek     56
5    sameer     70

Filtering in panda

In [40]:
df[df["marks"]>85]

      Name  age  marks
1   saurav   23     90
2    Karan   21     88
3  shubham   22     90

In [41]:
# Multiple condition
df[(df["age"]>21) & (df["marks"]>85)]

      Name  age  marks
1   saurav   23     90
3  shubham   22     90

Sorting + Value Counts

In [5]:
df.sort_values("marks",ascending=False)

     Name  age  marks
1  saurav   23     90
2   Karan   21     88
0    Aman   22     85

In [44]:
df["age"].value_counts()

age
22    2
23    1
21    1
25    1
26    1
Name: count, dtype: int64

Handling Missing values

In [6]:
# updating the dataset with null values
df = pd.DataFrame({
    "Name":["Aman","saurav","Karan","Shubham",None,"sameer"],
    "Age":[22,23,None,22,25,26],
    "Marks":[85,None,88,90,56,None]
})
df

      Name   Age  Marks
0     Aman  22.0   85.0
1   saurav  23.0    NaN
2    Karan   NaN   88.0
3  Shubham  22.0   90.0
4     None  25.0   56.0
5   sameer  26.0    NaN

In [7]:
df.isnull()#checking the missing values

    Name    Age  Marks
0  False  False  False
1  False  False   True
2  False   True  False
3  False  False  False
4   True  False  False
5  False  False   True

In [8]:
df.isnull().sum() #counting the missing values

Name     1
Age      1
Marks    2
dtype: int64

In [9]:
df.dropna()

      Name   Age  Marks
0     Aman  22.0   85.0
3  Shubham  22.0   90.0

In [10]:
print(df)

      Name   Age  Marks
0     Aman  22.0   85.0
1   saurav  23.0    NaN
2    Karan   NaN   88.0
3  Shubham  22.0   90.0
4     None  25.0   56.0
5   sameer  26.0    NaN